{
    "coreWebsitePages": [
        {
            "page": "Home",
            "title": "Security System Installations Cape Town | Global Security Solutions",
            "description": "Expert security system installations in Cape Town. We offer alarms, CCTV, and electric fencing. Get a free quote today from Global Security Solutions."
        },
        {
            "page": "About Us",
            "title": "About Global Security Solutions | Security Experts Cape Town",
            "description": "Your trusted security partner in Durbanville and the Western Cape. We specialize in high-quality security system installations, repairs, and maintenance."
        },
        {
            "page": "Contact Us",
            "title": "Contact Us | Security System Quotes Cape Town",
            "description": "Get a free quote on your security needs in Cape Town. Call 062 955 8559 or email Kyle for professional service and expert advice on all security systems."
        },
        {
            "page": "AI Security Advisor",
            "title": "AI Security Advisor | Custom Security Plans Cape Town",
            "description": "Use our AI Security Advisor to find the best security setup for your home or business. Get expert advice tailored to your needs by Global Security Solutions."
        },
        {
            "page": "Security Blog",
            "title": "Security Blog | Latest Safety Tips Cape Town",
            "description": "Stay safe with the latest security tips and news from Global Security Solutions. Learn how to protect your Cape Town property from local threats and crime."
        },
        {
            "page": "Frequently Asked Questions",
            "title": "Security FAQ | Expert Security Advice Cape Town",
            "description": "Find answers to common questions about security system installations and repairs in the Western Cape. Get expert help from the Global Security Solutions team."
        }
    ],
    "primaryServicePages": [
        {
            "page": "Alarm System Installation",
            "title": "Alarm System Installation Cape Town | Global Security Solutions",
            "description": "Professional alarm system installation for homes and businesses. We install AJAX, IDS, and Paradox systems for 24/7 safety and peace of mind in Cape Town."
        },
        {
            "page": "CCTV Surveillance Systems",
            "title": "CCTV Surveillance Cape Town | Camera System Installation",
            "description": "High-quality CCTV surveillance systems for constant security. Professional camera installation and remote viewing in Cape Town by Global Security Solutions."
        },
        {
            "page": "Access Control Solutions",
            "title": "Access Control Systems Cape Town | Global Security Solutions",
            "description": "Control access to your property with modern biometric and keypad systems. Expert setup for homes and businesses in Cape Town by the GSS team."
        },
        {
            "page": "Intercom System Installers",
            "title": "Intercom System Installers Cape Town | Global Security Solutions",
            "description": "Professional intercom installations for residential and estate properties. See and hear your visitors with ease. Expert setup by Global Security Solutions."
        },
        {
            "page": "Electric Fence Installations",
            "title": "Electric Fence Installations Cape Town | Professional Setup",
            "description": "Secure your boundary with professional electric fencing and compliance certificates. Quality perimeter protection in Cape Town by Global Security Solutions."
        },
        {
            "page": "Perimeter Security Enhancement",
            "title": "Perimeter Security Cape Town | Outdoor Beam Installation",
            "description": "Stop intruders before they reach your door. Expert installation of outdoor beams and perimeter security systems across Cape Town and the Western Cape."
        },
        {
            "page": "Gate and Garage Automation",
            "title": "Gate and Garage Automation Cape Town | Motor Repairs",
            "description": "Reliable gate and garage motor automation and fast repairs. We service all major brands for homes and businesses across Cape Town. Get your motor fixed today."
        },
        {
            "page": "Vehicle Security Systems",
            "title": "Vehicle Security Systems Cape Town | Asset Protection",
            "description": "Expert vehicle security and tracking systems for personal and commercial use. Professional asset protection and peace of mind by Global Security Solutions."
        },
        {
            "page": "Smart Home Automation",
            "title": "Smart Home Security Cape Town | App-Controlled Systems",
            "description": "Control your security from your smartphone with modern smart home tech. Expert integration services in Cape Town by the team at Global Security Solutions."
        },
        {
            "page": "Security System Integration",
            "title": "Security System Integration Cape Town | Linked Security",
            "description": "Link your alarms, CCTV, and access control into one manageable system. Expert security integration for estates and businesses by Global Security Solutions."
        },
        {
            "page": "Security Repairs and Upgrades",
            "title": "Security Repairs Cape Town | System Upgrades & Maintenance",
            "description": "Fast security system repairs and modern upgrades for all major brands. Get your alarm or CCTV system fixed today by our Cape Town security specialists."
        },
        {
            "page": "Security Maintenance Contracts",
            "title": "Security Maintenance Cape Town | Service Contracts",
            "description": "Ensure your security systems never fail with a regular maintenance contract. Priority support and emergency repairs for homes and businesses in Cape Town."
        }
    ],
    "sectorSolutions": [
        {
            "page": "Residential Security",
            "title": "Residential Security Cape Town | Home Alarm Systems",
            "description": "Custom security solutions for homes and families. We provide alarms, CCTV, and electric fencing to keep your Cape Town household safe and secure."
        },
        {
            "page": "Commercial Security",
            "title": "Commercial Security Cape Town | Business CCTV & Alarms",
            "description": "Professional security for businesses and offices in the Western Cape. Secure your assets with high-end access control and surveillance by Global Security Solutions."
        },
        {
            "page": "Industrial Security",
            "title": "Industrial Security Cape Town | Warehouse Protection",
            "description": "Robust security systems for factories and warehouses. Protect your industrial site with advanced surveillance and fencing from Global Security Solutions."
        },
        {
            "page": "Farm Security Systems",
            "title": "Farm Security Systems Western Cape | Perimeter Protection",
            "description": "Specialized security for farms and rural properties. We offer long-range perimeter protection and remote monitoring across the Western Cape."
        },
        {
            "page": "Estate Security Management",
            "title": "Estate Security Management Cape Town | Complex Security",
            "description": "Comprehensive security for residential estates and complexes. Professional management of access control and CCTV by the experts at Global Security Solutions."
        }
    ],
    "trustAndSupportPages": [
        {
            "page": "Project Gallery",
            "title": "Project Gallery | Security Installations Cape Town",
            "description": "See our completed security installations across Cape Town, including major projects like Chere Botha School. View our quality workmanship and expert setups."
        },
        {
            "page": "Free Security Audit",
            "title": "Free Security Audit Cape Town | Book Your Assessment",
            "description": "Request a free security assessment for your home or business. Let Global Security Solutions find your security weak points and suggest the best protection."
        },
        {
            "page": "Load Shedding Security Solutions",
            "title": "Load Shedding Security Cape Town | Battery Backups",
            "description": "Keep your security working during power outages. We offer battery backups and solar solutions for alarms and fencing in Cape Town. Stay safe in the dark."
        },
        {
            "page": "Brands We Install",
            "title": "Security Brands We Install | AJAX, Hikvision & IDS",
            "description": "We use only the best security hardware, including Hikvision, AJAX, IDS, and Paradox. Reliable technology installed by Global Security Solutions in Cape Town."
        },
        {
            "page": "Our Team",
            "title": "Meet the Team | Global Security Solutions Experts",
            "description": "Meet the expert team behind Global Security Solutions. Led by Kyle Cass (Owner) and Rashaad Steyn (COO). Your trusted Cape Town security partners."
        },
        {
            "page": "Warranty and Support",
            "title": "Warranty and Support | Global Security Solutions Cape Town",
            "description": "Learn about our installation warranties and after-sales support. Global Security Solutions stands by the quality of every security system we install."
        }
    ],
    "serviceAreaPages": [
        {
            "page": "Durbanville",
            "title": "Durbanville Security Services | Alarms & CCTV Installation",
            "description": "Expert security system installation in Durbanville. Global Security Solutions provides premium alarm, fencing, and CCTV services for your home and business."
        },
        {
            "page": "Blouberg",
            "title": "Blouberg Security Services | CCTV & Alarm Installation",
            "description": "Top-rated security systems and CCTV installation in Blouberg. Professional security services from the local experts at Global Security Solutions."
        },
        {
            "page": "Stellenbosch",
            "title": "Stellenbosch Security Services | Estate Security Experts",
            "description": "Top-tier security installations for Stellenbosch estates and homes. Expert alarm and fencing setup by Global Security Solutions."
        },
        {
            "page": "Somerset West",
            "title": "Somerset West Security Services | Home & Business Security",
            "description": "Professional security systems in Somerset West. We offer alarms, fencing, and CCTV for 24/7 safety and peace of mind. Get a free quote today."
        },
        {
            "page": "Milnerton",
            "title": "Milnerton Security Services | Complete Security Solutions",
            "description": "Comprehensive security services in Milnerton. We provide alarms, CCTV, and access control to keep your property safe and secure."
        },
        {
            "page": "Paarl",
            "title": "Paarl Security Services | Farm & Estate Security Experts",
            "description": "Expert security services in Paarl, including specialized farm and estate solutions. Secure your property with Global Security Solutions."
        },
        {
            "page": "Table View",
            "title": "Table View Security Services | Gate Automation & Alarms",
            "description": "Reliable security services and gate automation in Table View. Get a free quote from Global Security Solutions for your home or business today."
        },
        {
            "page": "Plattekloof",
            "title": "Plattekloof Security Services | Premium CCTV & Alarms",
            "description": "High-security installations for Plattekloof residents. Premium surveillance and alarm systems professionally installed by Global Security Solutions."
        },
        {
            "page": "Camps Bay",
            "title": "Camps Bay Security Services | Premium Home Security",
            "description": "Premium security installations for homes in Camps Bay. Global Security Solutions offers high-end CCTV, access control, and smart home automation."
        },
        {
            "page": "Gordon's Bay",
            "title": "Gordon's Bay Security Services | Alarms & Electric Fencing",
            "description": "Secure your property in Gordon's Bay with expert electric fencing and alarm systems from Global Security Solutions. Get a free quote today."
        },
        {
            "page": "Kuils River",
            "title": "Kuils River Security Services | Gate Automation & Alarms",
            "description": "Expert security installations and gate automation in Kuils River. Comprehensive security solutions from the team at Global Security Solutions."
        },
        {
            "page": "Kenilworth",
            "title": "Kenilworth Security Services | Home Automation & CCTV",
            "description": "Smart security systems and automation for Kenilworth homes. Integrated security solutions by Global Security Solutions for 24/7 protection."
        },
        {
            "page": "Fish Hoek",
            "title": "Fish Hoek Security Services | Reliable Alarms & Fencing",
            "description": "Affordable and reliable security installations for Fish Hoek residents. Professional alarms and fencing by the team at Global Security Solutions."
        },
        {
            "page": "Belhar",
            "title": "Belhar Security Services | Alarms & CCTV Installation",
            "description": "Professional security system installation and maintenance in Belhar. Global Security Solutions provides reliable alarms and CCTV for your safety."
        },
        {
            "page": "Melkbosstrand",
            "title": "Melkbosstrand Security Services | Coastal Security Experts",
            "description": "Specialized security installations for Melkbosstrand properties. Durable alarms and fencing from Global Security Solutions built to last."
        },
        {
            "page": "Pinelands",
            "title": "Pinelands Security Services | Intercoms & Alarm Systems",
            "description": "Professional alarm systems and intercom installations in Pinelands. Protect your home and family with Global Security Solutions."
        }
    ]
}